Readme.org
#+title: DoTEmacs
#+author: Devildev
#+date: 12/24
#+description: My emacs custom configuration.
#+property: header-args :tangle init.el
#+auto_tangle: t

* Preamble
** LICENSE
#+NAME: license
#+begin_src elisp :comments off
;;; Copyright (c) 2020-2023  Debarghya Datta <info@devildev.me>

;; Author: Debarghya Datta <info@devildev.me>
;; Version: 0.0.1
;; Package-Requires: ((emacs "29.1"))

;; This file is NOT part of GNU Emacs.

;; This file is free software: you can redistribute it and/or modify it
;; under the terms of the GNU General Public License as published by the
;; Free Software Foundation, either version 3 of the License, or (at
;; your option) any later version.
;;
;; This file is distributed in the hope that it will be useful, but
;; WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
;; General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.

#+end_src

** Front-matter
#+NAME: frontmatter
#+begin_src elisp :comments off
;;; Commentary:
;;  -----------------------------------------
;;  Do not edit the generated file, as it has
;;  been generated, as a tangled file, by the
;;  stupendous org-mode.
;;
;;  Make the changes in the corresponding
;;  Readme.org file, instead.
;;  -----------------------------------------

;;; Code:

#+end_src

* Package Management
I am using the in-built package management system, along with some custom modules.
#+begin_src elisp
;; package
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/"))

;; Path to custom modules (mandatory)
(dolist (path '("lisp"))
  (add-to-list 'load-path (locate-user-emacs-file path)))

(package-refresh-contents t) ; refresh async
(package-initialize) ; initialize
#+end_src

For installing the packages, the =use-package= format is very popular.
#+begin_src elisp
(require 'use-package-ensure)
(setq use-package-always-ensure t) ; always ensure installed

;; General: Making Keybindings easy
(use-package general
  :config
  (general-evil-setup t) ; I us eVIl
  )
#+end_src

* Early Config
This are the custom configuration, that is placed inside =early-init.el= file, and runs before the intializartion of GUI.

1. Basic Window functionalities
     #+begin_src elisp :tangle early-init.el :noweb yes
     ;;; early-init.el --- Early Init File -*- lexical-binding: t -*-
     <<license>>
     <<frontmatter>>
     (setq-default frame-resize-pixelwise t
		   frame-inhibit-implied-resize t
		   inhibit-splash-screen t	; splash screen
		   inhibit-startup-screen t	; startup screen
		   inhibit-x-resources t	; load x-resources
		   inhibit-startup-buffer-menu t
		   select-enable-clipboard t ; merge clipboard
		   help-window-select t	; focus help menu
		   scroll-conservatively 101 ; scroll recentering
		   scroll-margin 2 ; Add a margin when scrolling vertically
		   recenter-positions '(5 bottom)) ; re-centering positions
     #+end_src
2. Turning of the GUI decorations
     #+begin_src elisp :tangle early-init.el
     (setq-default show-help-function nil	; No help text
		   use-file-dialog nil       ; No file dialog
		   use-dialog-box nil        ; No dialog box
		   pop-up-windows nil)       ; No popup windows
     (menu-bar-mode -1)			; No menu bar
     (tooltip-mode -1)			; No tooltips
     (scroll-bar-mode -1)			; No scroll bars
     (tool-bar-mode -1)			; No toolbar

     (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local obsolete))
     #+end_src
3. Performance Enhancement
     #+begin_src elisp :tangle early-init.el
     ;; Garbage collection
     (setq gc-cons-threshold most-positive-fixnum
	   file-name-handler-alist nil
	   vc-handled-backends nil
	   package-enable-at-startup t)
     ;;; early-init.el ends here
     #+end_src

* UI Enhancement
** Faces
I use coding monospace fonts =Fira Code= and =Hack=.

#+begin_src elisp
;; Faces
(set-face-attribute 'default nil :family "Fira Code" :height 130)
(set-face-attribute 'italic nil :family "Hack")
(set-face-attribute 'bold nil :weight 'semibold)
;; Glyphs
(defface fallback '((t :family "Fira Code"
                       :inherit 'nano-face-faded)) "Fallback")
(set-display-table-slot standard-display-table 'truncation
                        (make-glyph-code ?… 'fallback))
(set-display-table-slot standard-display-table 'wrap
                         (make-glyph-code ?↩ 'fallback))
#+end_src

** Theme
Using the ~awesome~ Ef-themes, maintained by [[https://protesilaos.com/][Prot]].

#+begin_src elisp
;; Theme
(defun my-ef-themes-custom-faces ()
  "My customizations on top of the Ef themes.
This function is added to the `ef-themes-post-load-hook'."
  (ef-themes-with-colors
    (custom-set-faces

     ;; mode-line
     `(mode-line ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-main :underline ,bg-mode-line)))
     `(mode-line-inactive ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-main :underline ,bg-alt)))

     ;; nano-headline
     `(nano-modeline-active ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-mode-line :foreground ,fg-mode-line)))
     `(nano-modeline-primary ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-mode-line :foreground ,modeline-info)))
     `(nano-faded-inactive ((,c :inherit nano-modeline-active :background ,bg-cyan-subtle :forground ,fg-dim)))
     `(nano-modeline-status ((,c :inherit default :background ,bg-cyan-subtle :foreground ,fg-mode-line))))))

(add-hook 'ef-themes-post-load-hook #'my-ef-themes-custom-faces)

(use-package ef-themes
  :custom
  (ef-themes-mixed-fonts t)
  (ef-themes-to-toggle '(ef-spring ef-duo-dark))
  :config
  ;; Disable all other themes to avoid awkward blending:
  (mapc #'disable-theme custom-enabled-themes)
  (ef-themes-select 'ef-spring))
#+end_src

** Modeline/Headline
My modeline/headline is a customized version of [[https://github.com/rougier/nano-emacs][NANO emacs]].

#+begin_src elisp
;; Layout
(require 'disp-table)
(setq default-frame-alist
      (append (list
	       '(min-height . 1)
	       '(height     . 45)
	       '(min-width  . 1)
	       '(width      . 81)
	       '(vertical-scroll-bars . nil)
	       '(internal-border-width . 24)
	       '(left-fringe    . 1)
	       '(right-fringe   . 1)
	       '(tool-bar-lines . 0)
	       '(menu-bar-lines . 0))))
(require 'nano-modeline)		; modeline + headerline
;; Writer mode
(require 'writer)			; writer mode for ORG
#+end_src

* Packages
List of all the packages

** Server
We are using emacs as server-client architecture. So, we run the server, if its not running.
#+begin_src elisp
(use-package server
  :ensure nil
  :config
  (unless (server-running-p) (server-start)))
#+end_src

