init.el
;;; Copyright (c) 2020-2023  Debarghya Datta <info@devildev.me>

;; Author: Debarghya Datta <info@devildev.me>
;; Version: 0.0.1
;; Package-Requires: ((emacs "29.1"))

;; This file is NOT part of GNU Emacs.

;; This file is free software: you can redistribute it and/or modify it
;; under the terms of the GNU General Public License as published by the
;; Free Software Foundation, either version 3 of the License, or (at
;; your option) any later version.
;;
;; This file is distributed in the hope that it will be useful, but
;; WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
;; General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:
;;  -----------------------------------------
;;  Do not edit the generated file, as it has
;;  been generated, as a tangled file, by the
;;  stupendous org-mode.
;;
;;  Make the changes in the corresponding
;;  dotemacs.org file, instead.
;;  -----------------------------------------

;;; Code:

;; package
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/"))

;; Path to custom modules (mandatory)
(dolist (path '("lisp"))
  (add-to-list 'load-path (locate-user-emacs-file path)))

(package-refresh-contents t) ; refresh async
(package-initialize) ; initialize

(require 'use-package-ensure)
(setq use-package-always-ensure t) ; always ensure installed

;; General: Making Keybindings easy
(use-package general
  :config
  (general-evil-setup t) ; I us eVIl
  )

;; Faces
(set-face-attribute 'default nil :family "Fira Code" :height 130)
(set-face-attribute 'italic nil :family "Hack")
(set-face-attribute 'bold nil :weight 'semibold)
;; Glyphs
(defface fallback '((t :family "Fira Code"
                       :inherit 'nano-face-faded)) "Fallback")
(set-display-table-slot standard-display-table 'truncation
                        (make-glyph-code ?… 'fallback))
(set-display-table-slot standard-display-table 'wrap
                         (make-glyph-code ?↩ 'fallback))

;; Theme
(defun my-ef-themes-custom-faces ()
  "My customizations on top of the Ef themes.
This function is added to the `ef-themes-post-load-hook'."
  (ef-themes-with-colors
   (custom-set-faces

    ;; mode-line
    `(mode-line ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-main :underline ,bg-mode-line)))
    `(mode-line-inactive ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-main :underline ,bg-alt)))

    ;; nano-headline
    `(nano-modeline-active ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-mode-line :foreground ,fg-mode-line)))
    `(nano-modeline-primary ((,c :inherit ef-themes-ui-variable-pitch :background ,bg-mode-line :foreground ,modeline-info)))
    `(nano-faded-inactive ((,c :inherit nano-modeline-active :background ,bg-cyan-subtle :forground ,fg-dim)))
    `(nano-modeline-status ((,c :inherit default :background ,bg-cyan-subtle :foreground ,fg-mode-line))))))

(add-hook 'ef-themes-post-load-hook #'my-ef-themes-custom-faces)

(use-package ef-themes
  :custom
  (ef-themes-mixed-fonts t)
  (ef-themes-to-toggle '(ef-spring ef-night))
  :config
  ;; Disable all other themes to avoid awkward blending:
  (mapc #'disable-theme custom-enabled-themes)
  (ef-themes-select 'ef-spring))

;; Layout
(require 'disp-table)
(setq default-frame-alist
      (append (list
	       '(min-height . 1)
	       '(height     . 45)
	       '(min-width  . 1)
	       '(width      . 81)
	       '(vertical-scroll-bars . nil)
	       '(internal-border-width . 24)
	       '(left-fringe    . 1)
	       '(right-fringe   . 1)
	       '(tool-bar-lines . 0)
	       '(menu-bar-lines . 0))))
(require 'nano-modeline)		; modeline + headerline
;; Writer mode
(require 'writer)			; writer mode for ORG

(use-package server
  :ensure nil
  :config
  (unless (server-running-p) (server-start)))

;; Dashboard
