init.el
(use-package dashboard
  :custom
  (dashboard-banner-logo-title " Emacs made easy" "set the title")
  (dashboard-startup-banner "~/.config/emacs/lisp/banner.txt" "Banner setup")
  (dashboard-projects-backend 'project-el "set the project backend")
  (dashboard-items 
   '((projects . 2)
     (recents  . 3)
     (agenda . 3)) "Item numbers")
  (dashboard-week-agenda nil "show weekly agenda")
  (add-to-list 'dashboard-items '(agenda) t)
  (dashboard-set-footer nil "set footer")
  (dashboard-set-init-info nil "set init time")
  (dashboard-show-shortcuts nil "shortcut `jump' indicators")
  (dashboard-center-content t "center dashboard")
  (dashboard-agenda-prefix-format "%?-10b" "agenda prefix")
  (dashboard-agenda-tags-format nil "Tag (no need)")
  :custom-face
  (dashboard-text-banner ((t (:inherit fg-alt :weight bold))))
  (dashboard-banner-logo-title ((t (:inherit fg-dim :weight light :foreground "bg-main"))))
  ;; (dashboard-heading ((t (:inherit 'bold))))
  ;; (dashboard-items-face ((t (:inherit 'nano-face-default))))
  ;; (dashboard-no-items-face ((t (:inherit 'nano-face-faded))))
  ;; (dashboard-navigatir ((t (:inherit 'nano-face-faded))))
  :config
  (dashboard-setup-startup-hook))

(add-hook 'dashboard-mode-hook		; Make the dashboard clean
	  (lambda () (setq mode-line-format nil 
			   header-line-format nil)))

(add-hook 'server-after-make-frame-hook (lambda() ; Always start with *dashboard*
					  (switch-to-buffer dashboard-buffer-name)
					  (dashboard-mode)
					  (dashboard-refresh-buffer)))

;; Evil - Vim Mode
(use-package evil
  :custom 
  (evil-want-integration t "integrate it")
  (evil-want-keybinding nil "no keybinding")
  (evil-vsplit-window-right t "vsplit to right")
  (evil-split-window-below t "vsplit to below")

  (evil-want-C-u-delete nil)
  (evil-want-C-w-delete nil)
  (evil-want-C-h-delete nil)
  (evil-want-C-w-in-emacs-state nil)
  (evil-want-abbrev-expand-on-insert-exit nil)
  (evil-disable-insert-state-bindings t)

  (evil-want-change-word-to-end t)
  (evil-want-C-i-jump t)
  (evil-want-C-u-scroll t)
  (evil-want-C-d-scroll t)
  (evil-want-C-g-bindings nil)

  (evil-want-Y-yank-to-eol t) ; consistent with D
  (evil-want-empty-ex-last-command t)
  (evil-want-integration t)
  (evil-want-keybinding nil)
  (evil-want-minibuffer nil)

  :hook
  ('prog-mode . #'hs-minor-mode)	; make code folding work

  :config
  (evil-set-undo-system 'undo-redo) ; undo system
  (evil-mode))

(use-package evil-collection		; collection of key-bindings
  :after evil
  :config
  (evil-collection-init))

(use-package evil-org
  :after evil-collection
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)) ; org-agenda keybindings

;; vertico
(use-package vertico
  :custom
  (vertico-count 8 "Options to show")
  (vertico-resize t "resize acc to the number of options")
  (vertico-count-format nil "no count indicator")
  (vertico-cycle nil "cyclic options")
  :config
  (vertico-mode 1)
  (vertico-reverse-mode 1)
  (advice-add #'vertico--format-candidate :around
	      (lambda (orig cand prefix suffix index _start)
		(setq cand (funcall orig cand prefix suffix index _start))
		(concat
		 (if (= vertico--index index)
		     (propertize "» " 'face 'vertico-current)
		   "  ")
		 cand)))
  )

;; orderless
(use-package orderless
  :custom
  (completion-styles '(orderless basic) "Basic Styles")
  (completion-category-overrides '((file (styles basic partial-completion)))))

;; Marginilia
(use-package marginalia
  :custom
  (marginalia-max-relative-age 0)
  (marginalia--ellipsis "…" "Nicer ellipsis")
  (marginalia-align 'right "right alignment")
  (marginalia-align-offset -1 "one space on the right")
  :init
  (marginalia-mode))

;; which key
;; (use-package which-key
;;   :disabled
;;   :custom
;;   (which-key-side-window-location 'bottom)
;;   (which-key-separator " → ")
;;   :init
;;   (which-key-mode))

(use-package vc
  :ensure nil
  :custom
  ;; I only use Git.  If I ever need another, I will include it here.
  ;; This may have an effect on performance, as Emacs will not try to
  ;; check for a bunch of backends.
  (vc-handled-backends '(Git))

  :config
  ;; Those offer various types of functionality, such as blaming,
  ;; viewing logs, showing a dedicated buffer with changes to affected
  ;; files.
  (require 'vc-annotate)
  (require 'vc-dir)
  (require 'vc-git)
  (require 'add-log)
  (require 'log-view))

;; Magit
(use-package magit
  :custom
  (git-commit-summary-max-length 50)
  (git-commit-fill-column 72)
  (magit-define-global-key-bindings nil)
  (magit-section-visibility-indicator '("⮧")))

(use-package dired
  :ensure nil
  :custom
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (delete-by-moving-to-trash t)
  (dired-listing-switches
   "-AGFhlv --group-directories-first --time-style=long-iso")
  (dired-dwim-target t)
  (dired-auto-revert-buffer #'dired-directory-changed-p) ; also see `dired-do-revert-buffer'
  (dired-make-directory-clickable t) ; Emacs 29.1
  (dired-free-space nil) ; Emacs 29.1
  (dired-mouse-drag-files t) ; Emacs 29.1
  (dired-guess-shell-alist-user ; those are the suggestions for ! and & in Dired
        '(("\\.\\(png\\|jpe?g\\|tiff\\)" "feh" "xdg-open")
          ("\\.\\(mp[34]\\|m4a\\|ogg\\|flac\\|webm\\|mkv\\)" "mpv" "xdg-open")
		  (".*" "xdg-open")))
  :hook ((dired-mode-hook . dired-hide-details-mode)
	 (dired-mode-hook . hl-line-mode)))

;; Outline
(use-package outline
  :ensure nil
  :bind (:map outline-minor-mode-map
	      ("<tab>"   . outline-cycle)
	      ("S-<tab>" . outline-cycle-buffer)
	      ("M-j"     . outline-move-subtree-down)
	      ("M-k"     . outline-move-subtree-up)
	      ("M-h"     . outline-promote)
	      ("M-l"     . outline-demote))
  :config
  (add-hook 'emacs-lisp-mode-hook
	    (lambda ()
	      (setq-local outline-level #'outline-level)
	      (setq-local outline-regexp ";;;\\(;* \\)")
	      (setq-local outline-heading-alist
			  '((";;; " . 1)
			    (";;;; " . 2)
			    (";;;;; " . 3)
			    (";;;;;; " . 4)
			    (";;;;;;; " . 5))))))

;; Treesitter
(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt) ; Auto-install
  :config
  (global-treesit-auto-mode))

;; corfu
