Readme.org
** Completions
The completion UI and backend are provided by the following packages.
+ =corfu= - For completion popup
+ =cape= - For different completion backends

#+begin_src elisp
;; corfu
(use-package corfu
  :custom
  (corfu-cycle t)                ; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ; Enable auto completion
  (corfu-auto-prefix 3)		 ; Min length of prefix
  (corfu-separator ?\s)          ; Orderless field separator
  (corfu-quit-at-boundary nil)   ; Never quit at completion boundary
  (corfu-quit-no-match t)      ; quit, even if there is no match
  (corfu-preview-current 'insert)    ; current candidate preview
  (corfu-preselect 'prompt)      ; Preselect the prompt
  (corfu-on-exact-match nil)     ; Configure handling of exact matches
  (corfu-scroll-margin 5)        ; Use scroll margin

  :bind
  ;; For Tab and Go
  (:map corfu-map
        ("TAB" . corfu-next)
        ([tab] . corfu-next)
        ("S-TAB" . corfu-previous)
        ([backtab] . corfu-previous))

  ;; Enable Corfu only for certain modes.
  :hook ((prog-mode . corfu-mode)
         (shell-mode . corfu-mode)
         (eshell-mode . corfu-mode)))

;; cape
(use-package cape
  :defer t
  :init
  ;; Add `completion-at-point-functions', used by `completion-at-point'.
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file))
#+end_src
** Language Server Protocol
Code completion with language servers, is done using =Eglot=, which is
built-in to the emacs.
#+begin_src elisp
;; eglot
(use-package eglot
  :ensure nil
  ;; key-bindings
  :bind (("C-c l l" . eglot)
	 ("C-c l a" . eglot-code-actions)
	 ("C-c l r" . eglot-rename)
	 ("C-c l f" . eglot-format))
  :custom
  (eglot-autoshutdown t "Automatically shutdown")
  (eglot-events-buffer-size 0)
  (eglot-extend-to-xref nil)
  (eglot-sync-connect nil)
  (eldoc-message-function #'message)
  (eglot-ignored-server-capabilities
   '(:hoverProvider
     :documentHighlightProvider
     :documentOnTypeFormattingProvider
     :colorProvider
     :foldingRangeProvider)
   "Ignore some functionalities"))

;; Function to bundle backends
(defun my/eglot-capf ()
  (setq-local completion-at-point-functions
              (list (cape-super-capf
                     #'eglot-completion-at-point
                     #'cape-file))))

(setq completion-category-overrides '((eglot (styles orderless))))
(add-hook 'eglot-managed-mode-hook #'my/eglot-capf)
#+end_src

To enhance the experience for some languages.
*** Lua
#+begin_src elisp
(use-package lua-mode)
#+end_src
*** Markdown
#+begin_src elisp
(use-package markdown-mode)
#+end_src
*** Conda
Used for handling conda environment effectively.
#+begin_src bash :tangle no
# Need to set the ANACONDA_HOME in .zprofile/.bash_profile/etc.
export ANACONDA_HOME="$XDG_DATA_HOME/miniconda3"
#+end_src

#+begin_src elisp
(use-package conda
  :config
  (conda-env-initialize-interactive-shells)
  (conda-env-autoactivate-mode t))
#+end_src

** Formatting
Auto-format code with external formatters.

#+begin_src elisp
(use-package format-all
  :commands format-all-mode
  :hook (prog-mode . format-all-mode)
  :config
  (setq-default format-all-formatters '(("Shell" (shfmt "-i" "4" "-ci"))
					("Python" (black))
					("C" (clang-format))
					("C++" (clang-format))
					("Lua" (stylua)))))
#+end_src
** Project
Extend the built-in =project.el= capabilities, with custom functions.
#+begin_src elisp
;; project
(use-package project
  :ensure nil
  :custom
  (project-vc-extra-root-markers '("requirements.txt" "Gemfile" "autogen.sh" "pom.xml" "package.json" ".git" ".project")))
#+end_src

** Latex
Integrating the AucTex.
#+begin_src elisp
(require 'latex)
(setq TeX-engine-alist '((default
                          "Tectonic"
                          "tectonic -X compile -f plain %T"
                          "tectonic -X watch"
                          nil)))
(setq LaTeX-command-style '(("" "%(latex)")))
(setq TeX-process-asynchronous t
      TeX-check-TeX nil
      TeX-engine 'default)
(let ((tex-list (assoc "TeX" TeX-command-list))
      (latex-list (assoc "LaTeX" TeX-command-list)))
  (setf (cadr tex-list) "%(tex)"
        (cadr latex-list) "%l"))
#+end_src

