Readme.org
* Org Mode
The /in-famous/ org mode of Emacs.
#+begin_src elisp
;; Org
(require 'indian-holidays)		; Indian Holidays
(require 'org-tempo)			; Templates for Org

(use-package org
  :custom
                                        ; Org documents
  (org-directory "~/proj/mtech/org")
  (org-ellipsis " …" "Nicer ellipsis")
  (org-tags-column 1 "Tags next to header")
  (org-cycle-separator-lines 2  "empty lines between sections")
  (org-fontify-quote-and-verse-blocks t "face for quote and verse")
  (org-indent-indentation-per-level 2 "Indentation per level")
  (org-image-actual-width nil "Resize image to window width")
  (org-outline-path-complete-in-steps nil "No steps in path display")

                                        ; Interaction
  (org-link-use-indirect-buffer-for-internals t "links")
  (org-return-follows-link nil "Follow links with return")
  (org-indirect-buffer-display 'other-window "Tab to expand in a window")
  ;; (org-latex-create-formula-image-program 'dvisvgm "Better Latex preview")
  (org-use-tag-inheritance nil "Tags inheritence")
  (org-use-property-inheritance t "Properties inheritence")
  (org-latex-with-hyperref nil)

                                        ; Agenda
  (org-agenda-todo-keyword-format "%-4s" "Spacious format")
  (org-agenda-files '("~/proj/mtech/org/agenda.org"))
  (org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")))
  (org-log-done 'time) ; log the time of completion
  (org-agenda-start-with-log-mode t)
  (org-log-into-drawer t)
  (org-refile-targets
   '(("~/proj/mtech/org/archive.org" :maxlevel . 1)))
  (calendar-holidays holiday-indian-holidays)
  (org-agenda-custom-commands	       ; Configure custom agenda views
   `(("d" "Dashboard"
      ((agenda "" ((org-agenda-span 1)
                   (org-deadline-warning-days 0)
                   (org-agenda-block-separator nil)
                   (org-agenda-highlight-todo)
                   (org-scheduled-past-days 2)
                   (org-agenda-format-date "")
                   (org-agenda-overriding-header "Today's Agenda")))

       (agenda "" ((org-agenda-start-on-weekday nil)
                   (org-agenda-start-day "+1d")
                   (org-agenda-span 3)
                   (org-deadline-warning-days 0)
                   (org-agenda-block-separator nil)
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "\nNext three days")))

       (agenda "" ((org-agenda-time-grid nil)
                   (org-agenda-start-on-weekday nil)
                   (org-agenda-start-day "+4d")
                   (org-agenda-span 14)
                   (org-agenda-show-all-dates nil)
                   (org-deadline-warning-days 0)
                   (org-agenda-block-separator nil)
                   (org-agenda-entry-types '(:deadline))
                   (org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "\nUpcoming deadlines (+14d)")))))))
  (org-capture-templates
   `(("t" "Tasks / Projects")
     ("tw" "Task" entry (file+headline "~/proj/mtech/org/agenda.org" "WORK")
      "** TODO %^{task} :work:\nSCHEDULED: %^t\n%^{desc}%?\n" :empty-lines 1)
     ("tp" "Task" entry (file+headline "~/proj/mtech/org/agenda.org" "PERS")
      "** TODO %^{task} :per:\nSCHEDULED: %^t\n%^{desc}%?\n" :empty-lines 1)
     ))

                                        ; Export
  (org-src-fontify-natively t "Fontify code in code blocks")
  (org-adapt-indentation nil "Adaptive indentation")
  (org-src-tab-acts-natively t "Tab acts as in source editing")
  (org-confirm-babel-evaluate nil "No confirmation before executing code")
  (org-edit-src-content-indentation 0 "No relative indentation for code blocks")
  (org-fontify-whole-block-delimiter-line t "Fontify whole block")
  :config
  ;; save org buffers after refilling
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
  )

(require 'ox-latex)
;; Org latex classes
(add-to-list 'org-latex-classes
	     '("IEEEtran"
	       "\\documentclass[11pt]{IEEEtran}"
	       ("\\section{%s}" . "\\section*{%s}")
	       ("\\subsection{%s}" . "\\subsection*{%s}")
	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
	       ("\\paragraph{%s}" . "\\paragraph*{%s}")
	       ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))
	    '("beamer"
		"\\documentclass[presentation]{beamer}"
			"[DEFAULT-PACKAGES]"
			"[PACKAGES]"
			"[EXTRA]\n"
		("\\section{%s}" . "\\section*{%s}")
		("\\subsection{%s}" . "\\subsection*{%s}")
		("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
(setq org-latex-pdf-process '("tectonic %f"))
(setq org-latex-caption-above nil)	; caption position

(require 'ox-beamer)

(use-package org-auto-tangle		; Auto tangle after saving
  :hook (org-mode . org-auto-tangle-mode)
  :custom
  (org-auto-tangle-default t))


(use-package org-modern			; Modern UI for Org
  :custom
  (org-modern-hide-stars t))

#+end_src

As there are many code blocks type, we can make it easy with template engine.
Some of the example usage is shown below.
#+begin_example
<s  for source code block
<e  for source code block
#+end_example

* General Config
** Startup Messages
#+begin_src elisp
;; Welcome message
(let ((inhibit-message t))
  (message "Welcome to GNU Emacs / N Λ N O edition")
  (message (format "Initialization time: %s" (emacs-init-time))))
(setq initial-scratch-message "")
#+end_src

** Emacs settings

This settings are specifically to tweak the actions of Emacs.
#+begin_src elisp
;; Some basic settings
(setq frame-title-format '("%b")
      ring-bell-function 'ignore
      use-short-answers t
      native-compile-prune-cache t
      make-backup-files nil
      backup-inhibited nil
      create-lockfiles nil
      display-line-numbers-type 'relative
      custom-file (make-temp-file "emacs-custom-")
      completion-cycle-threshold 3
      tab-always-indent 'complete
      doc-view-resolution 200)

;; keep folders clean
(setq backup-directory-alist `(("." ., (expand-file-name "tmp/backups/" user-emacs-directory))))

;; auto-save-mode doesn't create the path automatically!
(make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
(setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))
;; disable lock files
(setq create-lockfiles nil)
#+end_src

** Startup Hooks
Specific modes for different workspaces.

#+begin_src elisp
;; Line number and Line-wrap
(add-hook 'text-mode-hook 'visual-line-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'prog-mode-hook 'visual-line-mode)

;; Highlight Current line
(add-hook 'prog-mode-hook #'hl-line-mode)
(add-hook 'text-mode-hook #'hl-line-mode)

;; Enable/Disable features
(dolist (c '(narrow-to-region narrow-to-page upcase-region downcase-region))
  (put c 'disabled nil))
(dolist (c '(eshell project-eshell overwrite-mode iconify-frame diary))
  (put c 'disabled t))

;; Recent files
(require 'recentf)
(recentf-mode 1)
#+end_src

